Update Design.md
